cavity/InletVel/vel=0.7/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.1 0 0)
    (0.9 0 0)
    (0.9 1 0)
    (-0.1 1 0)
    (-0.1 0 0.1)
    (0.9 0 0.1)
    (0.9 1 0.1)
    (-0.1 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
           
            
            (1 5 4 0)
	(3 7 6 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }

right
    {
        type patch;
        faces
        (
            (0 4 3 7)
            
        );
    }

left
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }



);

mergePatchPairs
(
);

// ************************************************************************* //
